src/cf/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонCДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМногострочноеПоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ИспользоватьДляОповещений</Name>
					<Comment>Использовать для оповещений</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогПроверятьПоЯндексу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогПроверятьПоDaDaTa</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогВводитьАдресЯндексом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогЗапретитьРедактированиеВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогПроверкаНаДубль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/CRM_МетодыФормСправочниковКлиент/Ext/Module.bsl
// В данный модуль вынесены методы подсистемы CRM, вызываемые из модулей типовых объектов. 
// Выносить можно только те методы, которые не вызывают стандартные методы типового модуля или обработчики форм. 
// Т.е. вызывают только те методы, что тоже вынесены из типового или не содержат таких вызовов.

// Для каждого объекта необходимо задать свою #Область с именем объекта и модуля, как он называется в метаданных.

#Область Справочник_ВидыКонтактнойИнформации_ФормаЭлемента

// Процедура установливает доступность флажка "CRM_Основной".
//
// Параметры:
//	Нет.
//
Процедура УстановитьВидимостьОсновной(Форма) Экспорт
	
	Если (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров"))
		ИЛИ (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникПартнеры"))
		ИЛИ (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_СправочникПартнерыКомпания"))
		ИЛИ (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо"))
		ИЛИ (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочниквогРаспределительныеЦентры"))
		ИЛИ (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочниквогРынки"))Тогда
		Форма.Элементы.CRM_Основной.Видимость = Истина;
	Иначе
		Форма.Элементы.CRM_Основной.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьОсновной()

// Процедура установливает доступность флажка "CRM_ИспользоватьДляОповещений".
//
// Параметры:
//	Нет.
//
Процедура УстановитьВидимостьИспользоватьДляОповещений(Форма) Экспорт
	
	Если (Форма.Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"))
		ИЛИ (Форма.Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты")) Тогда
		Форма.Элементы.CRM_ИспользоватьДляОповещений.Видимость = Истина;
	Иначе
		Форма.Элементы.CRM_ИспользоватьДляОповещений.Видимость = Ложь;
		Если Форма.Объект.CRM_ИспользоватьДляОповещений Тогда
			Форма.Объект.CRM_ИспользоватьДляОповещений = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры // УстановитьДоступностьИспользоватьДляОповещений()

#КонецОбласти

#Область Справочник_ФизическиеЛица_ФормаЭлемента

Процедура ФизическиеЛицаФормаЭлементаПослеЗаписи(Форма, Объект) Экспорт
	
	Если Форма.НеобходимоОповещение Тогда
		CRM_ВзаимодействияКлиент.КонтактСоздан(Объект.Ссылка, Объект.Наименование, Форма.ОбъектОснование);
		Оповестить("ЗаполнитьКонтактВТелефонномЗвонке", Новый Структура("Звонок, Контакт", Форма.ОбъектОснование, Объект.Ссылка));
		Форма.НеобходимоОповещение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
